tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
cask "java"
cask "adoptopenjdk8"
# Graphical system information display for macOS
brew "archey"
# Automatic configure script builder
brew "autoconf"
brew "sqlite"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
brew "bash-completion@2"
# Informative, fancy bash prompt for Git users
brew "bash-git-prompt"
# Platform built on V8 to build network applications
brew "node"
# Asynchronous DNS library
brew "c-ares"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Cross-platform make
brew "cmake"
# Tool for service discovery, monitoring and configuration
brew "consul"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Message bus system, providing inter-application communication
brew "dbus"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Functional programming language for building browser-based GUIs
brew "elm", link: false
# Charset analyzer and converter
brew "enca"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Alias for git commit --fixup <ref>
brew "git-fixup"
# Open GitHub webpages from a terminal
brew "git-open"
# Portable Foreign Function Interface library
brew "libffi"
# Core application library for C
brew "glib"
# Bash and Zsh completion for Gradle
brew "gradle-completion"

brew "maven-completion"
brew "docker-completion"
brew "docker-compose-completion"
# SonarQube completions
brew "sonar-completion"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Time series, events, and metrics database
brew "influxdb"
# Publish-subscribe messaging rethought as a distributed commit log
brew "kafka" #Java1.8 required
# Build tool for Clojure
brew "leiningen"
# Asynchronous event library
brew "libevent"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Keep your Mac's application settings in sync
# giver problemer fordi nogle programmer ikke har de rigtige adgange til den symlinkede foldere
#brew "mackup"
# Java-based project management
brew "maven" #Java1.7+ is required
# High-performance, schema-free, document-oriented database
brew "mongodb"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Lightweight database library
brew "tokyo-cabinet"
# Mongrel of mail user agents (part elm, pine, mush, mh, etc.)
brew "mutt"
# Open source relational database management system
brew "mysql"
# Port scanning utility for large networks
brew "nmap"
brew "node"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Manage compile and link flags for libraries
brew "pkg-config"
# Draw UML diagrams
brew "plantuml"
# Service monitoring system and time series database
brew "prometheus"
# Cross-platform application and UI framework
brew "qt"
# Messaging broker
brew "rabbitmq"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Rootkit hunter
brew "rkhunter"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# HTTP regression testing and benchmarking utility
brew "siege"
# Manage code quality
brew "sonarqube"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Mac App Store command-line interface
brew "mas"
# TL-DR for man pages
brew tldr
# Top-like interface for container metrics
brew ctop
# The lazier way to manage everything docker
brew lazydocker
# Modern replacement for 'ls'
brew exa
# Search tool like grep and The Silver Searcher
brew rg
cask "beyond-compare"
cask "dropbox"
cask "intellij-idea"
cask "jetbrains-toolbox"
cask "docker"
cask "brave-browser"
cask "postman"
cask "keybase"
cask "iterm2"
# This is a Quick Look plug-in that renders source code with syntax highlighting.
cask "qlcolorcode"
cask "qlmarkdown"
#  Apple OSX QuickLook plugin that lets you view plain text files without a file extension
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "qlvideo"
# secure messaging
cask "signal"
cask "slack"
cask "sourcetree"
cask "spotify"
# Validator S.A.C. (Stand Alone Complex) is a version of the W3C's HTML / XHTML Markup Validator for Mac OS X.
cask "validator-sac"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
# Keyboard modification/mapping
cask "karabiner-elements"
# Move and resize windows in macOS using keyboard shortcuts or snap areas
cask "rectangle"
#mas "iMovie", id: 408981434
#mas "iPhoto", id: 408981381
#mas "Ka-Block!", id: 1335413823
#mas "Keynote", id: 409183694
#mas "Numbers", id: 409203825
#mas "OmniGraffle", id: 1142578753
#mas "Pages", id: 409201541
#mas "Pocket", id: 568494494
#mas "Spark", id: 1176895641
