tap "go-delve/delve"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"
cask "java8"
brew "apache-flink"
brew "archey"
brew "autoconf"
brew "sqlite"
brew "awscli"
brew "bash-git-prompt"
brew "c-ares"
brew "cctools"
brew "certbot"
brew "cmake"
brew "coreutils"
brew "dbus"
brew "drip"
brew "elixir"
brew "elm", link: false
brew "geoip"
brew "gettext"
brew "git"
brew "git-extras"
brew "git-fixup"
brew "git-open"
brew "libffi"
brew "glib"
brew "gradle-completion"
brew "grafana"
brew "htop"
brew "influxdb"
brew "kafka"
brew "leiningen"
brew "libevent"
brew "libgcrypt"
brew "libxml2"
brew "libyaml"
brew "mackup"
brew "mas"
brew "maven"
brew "mongodb"
brew "moreutils"
brew "tokyo-cabinet"
brew "mutt"
brew "mysql"
brew "nmap"
brew "node"
brew "openconnect"
brew "openssl@1.1"
brew "pkg-config"
brew "plantuml"
brew "qt"
brew "rabbitmq"
brew "rbenv"
brew "redis"
brew "rkhunter"
brew "sonarqube"
brew "ssh-copy-id"
brew "tidy-html5"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
cask "beyond-compare"
cask "dropbox"
cask "gpgtools"
cask "gpgtools-beta"
cask "intellij-idea"
cask "iterm2"
cask "ip-scanner"
cask "keybase"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "signal"
cask "slack"
cask "sourcetree"
cask "sublime-text2"
cask "spotify"
cask "validator-sac"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wireshark"
mas "Gomoku-desktop", id: 457851462
mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "Ka-Block!", id: 1335413823
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Spark", id: 1176895641
